The fabrication part insulation specification identifier.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
 Syntax
  C#
public int InsulationSpecification { get; set; }
  Visual Basic
Public Property InsulationSpecification As Integer
	Get
	Set
  Visual C++
public:
property int InsulationSpecification {
	int get ();
	void set (int value);
}
 Remarks
 A value of 0 indicates the insulation specification is set to off.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentException   |   When setting this property: the insulation specification is invalid for the fabrication part.
   Autodesk.Revit.Exceptions InvalidOperationException   |   When setting this property: the fabrication part has taps connected. -or- When setting this property: the specification fails to be set by identifier: specId.
 See Also
  FabricationPart Class
  Autodesk.Revit.DB Namespace